RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_rtc.c
    if(RTC_ALARM0 == rtc_alarm) {
        RTC_CTL |= RTC_CTL_ALRM0EN;
    } else {
        RTC_CTL |= RTC_CTL_ALRM1EN;
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    }
}

/*!
    \brief      disable RTC alarm(API_ID(0x000DU))
    \param[in]  rtc_alarm: RTC_ALARM0 or RTC_ALARM1
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_alarm_disable(uint8_t rtc_alarm)
{
    volatile uint32_t time_index = RTC_ALRMXWF_TIMEOUT;
    ErrStatus error_status = ERROR;
    uint32_t flag_status = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RTC_ALARM_VALID(rtc_alarm)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* clear the state of alarm */
    if(RTC_ALARM0 == rtc_alarm) {
        RTC_CTL &= (uint32_t)(~RTC_CTL_ALRM0EN);
        /* wait until ALRM0WF flag to be set after the alarm is disabled */
        do {
            flag_status = RTC_STAT & RTC_STAT_ALRM0WF;
        } while((--time_index > 0U) && ((uint32_t)RESET == flag_status));
    } else {
        RTC_CTL &= (uint32_t)(~RTC_CTL_ALRM1EN);
        /* wait until ALRM1WF flag to be set after the alarm is disabled */
        do {
            flag_status = RTC_STAT & RTC_STAT_ALRM1WF;
        } while((--time_index > 0U) && ((uint32_t)RESET == flag_status));
    }

    if((uint32_t)RESET != flag_status) {
        error_status = SUCCESS;
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    }

    return error_status;
}

/*!
    \brief      enable RTC time-stamp(API_ID(0x000EU))
    \param[in]  edge: specify which edge to detect of time-stamp
                only one parameter can be selected which is shown as below:
      \arg        RTC_TIMESTAMP_RISING_EDGE: rising edge is valid event edge for timestamp event
      \arg        RTC_TIMESTAMP_FALLING_EDGE: falling edge is valid event edge for timestamp event
    \param[out] none
    \retval     none
*/
void rtc_timestamp_enable(uint32_t edge)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RTC_EDGE(edge)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg_ctl = 0U;

        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2;

        /* clear the bits to be configured in RTC_CTL */
        reg_ctl = (uint32_t)(RTC_CTL & (uint32_t)(~(RTC_CTL_TSEG | RTC_CTL_TSEN)));

        /* new configuration */
        reg_ctl |= (uint32_t)(edge | RTC_CTL_TSEN);

        RTC_CTL = (uint32_t)reg_ctl;

        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
    }
}

/*!
    \brief      disable RTC time-stamp(API_ID(0x000FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rtc_timestamp_disable(void)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* clear the TSEN bit */
    RTC_CTL &= (uint32_t)(~ RTC_CTL_TSEN);

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      configure RTC time-stamp internal event(API_ID(0x00010U))
    \param[in]  mode: specify which internal or external event to be detected
                only one parameter can be selected which is shown as below:
      \arg        RTC_ITSEN_DISABLE: disable RTC time-stamp internal event
      \arg        RTC_ITSEN_ENABLE: enable RTC time-stamp internal event
    \param[out] none
    \retval     none
*/
void rtc_timestamp_internalevent_config(uint32_t mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* Check parameters */
    if(NOT_RTC_ITSEN_MODE_VALID(mode)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00010U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    if(mode == RTC_ITSEN_ENABLE) {
        RTC_CTL |= RTC_CTL_ITSEN;
    } else {
        RTC_CTL &= ~(uint32_t)RTC_CTL_ITSEN;
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    }
}

/*!
    \brief      get RTC timestamp time and date(API_ID(0x00011U))
    \param[in]  none
    \param[out] rtc_timestamp: pointer to a rtc_timestamp_struct structure which contains
                parameters for RTC time-stamp configuration
                members of the structure and the member values are shown as below:
                  timestamp_month: RTC_JAN, RTC_FEB, RTC_MAR, RTC_APR, RTC_MAY, RTC_JUN,
                                       RTC_JUL, RTC_AUG, RTC_SEP, RTC_OCT, RTC_NOV, RTC_DEC
                  timestamp_date: 0x1 - 0x31(BCD format)
                  timestamp_day: RTC_MONDAY, RTC_TUESDAY, RTC_WEDNESDAY, RTC_THURSDAY, RTC_FRIDAY,
                                     RTC_SATURDAY, RTC_SUNDAY
                  timestamp_hour: 0x0 - 0x12(BCD format) or 0x0 - 0x23(BCD format) depending on the RTC display_format
                  timestamp_minute: 0x0 - 0x59(BCD format)
                  timestamp_second: 0x0 - 0x59(BCD format)
                  am_pm: RTC_AM, RTC_PM
    \retval     none
*/
void rtc_timestamp_get(rtc_timestamp_struct *rtc_timestamp)
{
    uint32_t temp_tts = 0U, temp_dts = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    /* Check parameters */
    if(NOT_RTC_VALID_POINTER(rtc_timestamp)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00011U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the value of time_stamp registers */
       temp_tts = (uint32_t)RTC_TTS;
       temp_dts = (uint32_t)RTC_DTS;

    /* get timestamp time and construct the rtc_timestamp_struct structure */
    rtc_timestamp->am_pm = (uint32_t)(temp_tts & RTC_TTS_PM);
    rtc_timestamp->timestamp_month = (uint8_t)GET_DTS_MON(temp_dts);
    rtc_timestamp->timestamp_date = (uint8_t)GET_DTS_DAY(temp_dts);
    rtc_timestamp->timestamp_day = (uint8_t)GET_DTS_DOW(temp_dts);
    rtc_timestamp->timestamp_hour = (uint8_t)GET_TTS_HR(temp_tts);
    rtc_timestamp->timestamp_minute = (uint8_t)GET_TTS_MN(temp_tts);
    rtc_timestamp->timestamp_second = (uint8_t)GET_TTS_SC(temp_tts);
    }
}

/*!
    \brief      get RTC time-stamp subsecond(API_ID(0x00012U))
    \param[in]  none
    \param[out] none
    \retval     RTC time-stamp subsecond value
*/
uint32_t rtc_timestamp_subsecond_get(void)
{

    return ((uint32_t)RTC_SSTS);
}

/*!
    \brief      enable RTC tamper(API_ID(0x00013U))
    \param[in]  rtc_tamper: pointer to a rtc_tamper_struct structure which contains
                parameters for RTC tamper configuration
                members of the structure and the member values are shown as below:
                  detecting tamper event can using edge mode or level mode
                  (1) using edge mode configuration:
                  tamper_source: RTC_TAMPER0, RTC_TAMPER1
                  tamper_trigger: RTC_TAMPER_TRIGGER_EDGE_RISING, RTC_TAMPER_TRIGGER_EDGE_FALLING
                  tamper_filter: RTC_FLT_EDGE
                  tamper_with_timestamp: DISABLE, ENABLE
                  (2) using level mode configuration:
                  tamper_source: RTC_TAMPER0, RTC_TAMPER1
                  tamper_trigger:RTC_TAMPER_TRIGGER_LEVEL_LOW, RTC_TAMPER_TRIGGER_LEVEL_HIGH
                  tamper_filter: RTC_FLT_2S, RTC_FLT_4S, RTC_FLT_8S
                  tamper_sample_frequency: RTC_FREQ_DIV32768, RTC_FREQ_DIV16384, RTC_FREQ_DIV8192,
                                               RTC_FREQ_DIV4096, RTC_FREQ_DIV2048, RTC_FREQ_DIV1024,
                                               RTC_FREQ_DIV512, RTC_FREQ_DIV256
                  tamper_precharge_enable: DISABLE, ENABLE
                  tamper_precharge_time: RTC_PRCH_1C, RTC_PRCH_2C, RTC_PRCH_4C, RTC_PRCH_8C
                  tamper_with_timestamp: DISABLE, ENABLE
    \param[out] none
    \retval     none
*/
void rtc_tamper_enable(rtc_tamper_struct *rtc_tamper)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* Check parameters */
    if(NOT_RTC_VALID_POINTER(rtc_tamper)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00013U), ERR_PARAM_POINTER);
    } else if(NOT_RTC_TAMPER_SOURCE(rtc_tamper->tamper_source)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00013U), ERR_PARAM_INVALID);
    } else if(NOT_RTC_TAMPER_TRIGGER_VALID(rtc_tamper->tamper_trigger)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00013U), ERR_PARAM_INVALID);
    } else if(NOT_RTC_TAMPER_FILTER_VALID(rtc_tamper->tamper_filter)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00013U), ERR_PARAM_INVALID);
    } else if((rtc_tamper->tamper_filter != RTC_FLT_EDGE) && NOT_RTC_SAMPLE_FREQ_VALID(rtc_tamper->tamper_sample_frequency)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00013U), ERR_PARAM_INVALID);
    } else if((rtc_tamper->tamper_filter != RTC_FLT_EDGE) && NOT_RTC_TAMPER_PRECHARGE_TIME(rtc_tamper->tamper_precharge_time)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00013U), ERR_PARAM_INVALID);
    } else if((rtc_tamper->tamper_precharge_enable != DISABLE) && (rtc_tamper->tamper_precharge_enable != ENABLE)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00013U), ERR_PARAM_INVALID);
    } else if((rtc_tamper->tamper_with_timestamp != DISABLE) && (rtc_tamper->tamper_with_timestamp != ENABLE)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00013U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable tamper */
      RTC_TAMP &= (uint32_t)~(rtc_tamper->tamper_source);

    /* tamper filter must be used when the tamper source is voltage level detection */
      RTC_TAMP &= (uint32_t)~RTC_TAMP_FLT;

    /* the tamper source is voltage level detection */
      if((uint32_t)(rtc_tamper->tamper_filter) != RTC_FLT_EDGE) {
      RTC_TAMP &= (uint32_t)~(RTC_TAMP_DISPU | RTC_TAMP_PRCH | RTC_TAMP_FREQ | RTC_TAMP_FLT);

        /* check if the tamper pin need precharge, if need, then configure the precharge time */
        if(DISABLE == rtc_tamper->tamper_precharge_enable) {
            RTC_TAMP |= (uint32_t)RTC_TAMP_DISPU;
        } else {
            RTC_TAMP |= (uint32_t)(rtc_tamper->tamper_precharge_time);
        }

