RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_rtc.c
        RTC_TAMP |= (uint32_t)(rtc_tamper->tamper_sample_frequency);
        RTC_TAMP |= (uint32_t)(rtc_tamper->tamper_filter);

        /* configure the tamper trigger */
        RTC_TAMP &= ((uint32_t)~((rtc_tamper->tamper_source) << RTC_TAMPER_TRIGGER_POS));
        if(RTC_TAMPER_TRIGGER_LEVEL_LOW != rtc_tamper->tamper_trigger) {
            RTC_TAMP |= (uint32_t)((rtc_tamper->tamper_source) << RTC_TAMPER_TRIGGER_POS);
        }
    } else {
        /* configure the tamper trigger */
        RTC_TAMP &= ((uint32_t)~((rtc_tamper->tamper_source) << RTC_TAMPER_TRIGGER_POS));
        if(RTC_TAMPER_TRIGGER_EDGE_RISING != rtc_tamper->tamper_trigger) {
            RTC_TAMP |= (uint32_t)((rtc_tamper->tamper_source) << RTC_TAMPER_TRIGGER_POS);
        }
    }
    RTC_TAMP &= (uint32_t)~RTC_TAMP_TPTS;
    if(DISABLE != rtc_tamper->tamper_with_timestamp) {
        /* the tamper event also cause a time-stamp event */
        RTC_TAMP |= (uint32_t)RTC_TAMP_TPTS;
    }
    /* enable tamper */
    RTC_TAMP |= (uint32_t)(rtc_tamper->tamper_source);
    }
}

/*!
    \brief      disable RTC tamper(API_ID(0x00014U))
    \param[in]  source: specify which tamper source to be disabled
                only one parameter can be selected which is shown as below:
      \arg        RTC_TAMPER0
      \arg        RTC_TAMPER1
    \param[out] none
    \retval     none
*/
void rtc_tamper_disable(uint32_t source)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* Check parameters */
    if(NOT_RTC_TAMPER_SOURCE(source)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00014U), ERR_PARAM_INVALID);
    }
#endif /* FW_DEBUG_ERR_REPORT */
    /* disable tamper */
    RTC_TAMP &= (uint32_t)~source;

}

/*!
    \brief      select the RTC output pin(API_ID(0x00015U))
    \param[in]  outputpin: specify the RTC output pin is PC13 or PB2
      \arg        RTC_OUT_PC13: the RTC output pin is PC13
      \arg        RTC_OUT_PB2: the RTC output pin is PB2
    \param[out] none
    \retval     none
*/
void rtc_output_pin_select(uint32_t outputpin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RTC_OUTPUTPIN(outputpin)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00015U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ErrStatus error_status = ERROR;

        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2;

        /* enter init mode */
        error_status = rtc_init_mode_enter();

        if(ERROR != error_status) {
            RTC_CFG &= (uint32_t)(~RTC_CFG_OUT2EN);
            RTC_CFG |= (uint32_t)(outputpin);
            /* exit init mode */
            rtc_init_mode_exit();
        }

        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
    }
}

/*!
    \brief      configure RTC alarm output source(API_ID(0x00016U))
    \param[in]  source: specify signal to output
                only one parameter can be selected which is shown as below:
      \arg        RTC_ALARM0_HIGH: when the  alarm0 flag is set, the output pin is high
      \arg        RTC_ALARM0_LOW: when the  alarm0 flag is set, the output pin is low
      \arg        RTC_ALARM1_HIGH: when the  alarm1 flag is set, the output pin is high
      \arg        RTC_ALARM1_LOW: when the  alarm1 flag is set, the output pin is low
      \arg        RTC_WAKEUP_HIGH: when the  wakeup flag is set, the output pin is high
      \arg        RTC_WAKEUP_LOW: when the  wakeup flag is set, the output pin is low
    \param[in]  mode: specify the output pin mode when output alarm signal or auto wakeup signal
      \arg        RTC_ALARM_OUTPUT_OD: open drain mode
      \arg        RTC_ALARM_OUTPUT_PP: push pull mode
    \param[out] none
    \retval     none
*/
void rtc_alarm_output_config(uint32_t source, uint32_t mode)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RTC_ALARM_OUTPUT_SOURCE_VALID(source)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00016U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2;

        RTC_CTL &= ~(RTC_CTL_OS | RTC_CTL_OPOL);

        RTC_CTL |= (uint32_t)(source);
        /* alarm output */
        RTC_CFG |= (uint32_t)(mode);
        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
    }
}

/*!
    \brief      configure RTC calibration output source(API_ID(0x00017U))
    \param[in]  source: specify signal to output
      \arg        RTC_CALIBRATION_512HZ: when the LSE freqency is 32768Hz and the RTC_PSC
                                         is the default value, output 512Hz signal
      \arg        RTC_CALIBRATION_1HZ: when the LSE freqency is 32768Hz and the RTC_PSC
                                       is the default value, output 1Hz signal
    \param[out] none
    \retval     none
*/
void rtc_calibration_output_config(uint32_t source)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RTC_SOURCE(source)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00017U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2;

        RTC_CTL &= (uint32_t)~(RTC_CTL_COEN | RTC_CTL_COS);

        RTC_CTL |= (uint32_t)(source);
        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
    }
}

/*!
    \brief      adjust the daylight saving time by adding or substracting one hour from the current time(API_ID(0x00018U))
    \param[in]  operation: hour adjustment operation
                only one parameter can be selected which is shown as below:
      \arg        RTC_CTL_A1H: add one hour
      \arg        RTC_CTL_S1H: substract one hour
    \param[out] none
    \retval     none
*/
void rtc_hour_adjust(uint32_t operation)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RTC_OPERATION(operation)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x00018U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2;

